[
  {
    "id": 1,
    "title": "The Rise of Quantum Computing in Cybersecurity",
    "date": "June 15, 2024",
    "image": "/images/quantum-computing.jpeg",
    "content": "<p>Quantum computing is revolutionizing the field of cybersecurity. As these powerful machines become more accessible, they're both a threat to current encryption methods and a potential solution for creating unbreakable codes...</p>",
    "comments": [
      {
        "id": 1,
        "name": "Tech Enthusiast",
        "content": "This is fascinating! I wonder how soon we'll see practical applications in everyday cybersecurity.",
        "date": "June 15, 2024, 14:30:00"
      },
      {
        "id": 1726449543551,
        "name": "Anonymous",
        "content": "comment",
        "date": "2024-09-16T01:19:03.643Z"
      },
      {
        "id": 1726449585388,
        "name": "spookie",
        "content": "Cybersecurity essential",
        "date": "2024-09-16T01:19:45.418Z"
      }
    ]
  },
  {
    "id": 2,
    "title": "AI-Driven Customer Service: The New Frontier",
    "date": "June 10, 2024",
    "image": "/images/ai-customer-service.jpeg",
    "content": "<p>Artificial Intelligence is transforming customer service in the tech industry. From chatbots to predictive analytics, AI is helping companies provide faster, more personalized support to their customers...</p>",
    "comments": [
      {
        "id": 1726754657071,
        "name": "spookie",
        "content": "well informed",
        "date": "2024-09-19T14:04:17.154Z"
      }
    ]
  },
  {
    "id": 3,
    "title": "The Impact of 5G on IoT Development",
    "date": "June 5, 2024",
    "image": "/images/5g-iot.jpeg",
    "content": "<p>As 5G networks become more widespread, the Internet of Things (IoT) is experiencing a significant boost. This new technology is enabling faster, more reliable connections between devices, opening up new possibilities for smart homes, cities, and industries...</p>",
    "comments": [
      {
        "id": 1726450213354,
        "name": "spookie",
        "content": "comment",
        "date": "2024-09-16T01:30:13.452Z"
      }
    ]
  },
  {
    "id": 4,
    "title": "Blockchain Beyond Cryptocurrency: Enterprise Applications",
    "date": "May 30, 2024",
    "image": "/images/blockchain-enterprise.jpeg",
    "content": "<p>While blockchain is widely known for its role in cryptocurrency, its potential extends far beyond. Enterprises are now exploring how this technology can improve supply chain management, secure data sharing, and streamline business processes...</p>",
    "comments": []
  },
  {
    "id": 5,
    "title": "The Evolution of Cloud Computing: Edge and Fog Computing",
    "date": "May 25, 2024",
    "image": "/images/edge-computing.jpeg",
    "content": "<p>Cloud computing is evolving with the emergence of edge and fog computing. These new paradigms bring computation and data storage closer to the point of need, reducing latency and enabling real-time processing for IoT devices and time-sensitive applications...</p>",
    "comments": []
  }
]